{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyOmQn45tSgAUmLem4lOtNtn"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","execution_count":1,"metadata":{"id":"amnARCFFJ7XA","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1763904974238,"user_tz":-60,"elapsed":9330,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"1783af4a-d8b3-4759-f0cb-9ccda648911b"},"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting rdflib\n","  Downloading rdflib-7.4.0-py3-none-any.whl.metadata (12 kB)\n","Requirement already satisfied: pyparsing<4,>=2.1.0 in /usr/local/lib/python3.12/dist-packages (from rdflib) (3.2.5)\n","Downloading rdflib-7.4.0-py3-none-any.whl (569 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m569.0/569.0 kB\u001b[0m \u001b[31m6.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: rdflib\n","Successfully installed rdflib-7.4.0\n"]}],"source":["### SETUP CELL - RUN THIS FIRST\n","!pip install rdflib\n","import rdflib\n","from rdflib import Graph"]},{"cell_type":"code","source":["path_to_ex1 = \"https://raw.githubusercontent.com/IDA-FBK/mental-health-ontology/refs/heads/conceptualization-dev/examples/ex1-manual.ttl\"\n","ex1_graph = Graph()\n","ex1_graph.parse(path_to_ex1, format=\"ttl\")\n","\n","path_to_ex2 = \"https://raw.githubusercontent.com/IDA-FBK/mental-health-ontology/refs/heads/conceptualization-dev/examples/ex2-automatic.ttl\"\n","ex2_graph = Graph()\n","ex2_graph.parse(path_to_ex2, format=\"ttl\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"JgHGqgCSduNa","executionInfo":{"status":"ok","timestamp":1763904979155,"user_tz":-60,"elapsed":791,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"4bbd293c-1411-4e32-9d8f-00f56f9180c1"},"execution_count":2,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N0e36287042f34f27ab07a2beb671f90d (<class 'rdflib.graph.Graph'>)>"]},"metadata":{},"execution_count":2}]},{"cell_type":"code","source":["## CQ ##\n","# Which data sources did human experts use to detect depression?\n","\n","q1 = ex1_graph.query(\n","\"\"\"\n","  PREFIX ex1:<https://w3id.org/miao/ex1#>\n","  SELECT DISTINCT ?expertLabel ?dataSourceLabel\n","  WHERE {\n","    ?detection a miao:ManualMentalIllnessesDetection ;\n","            miao:hasInputData ?data ;\n","            prov:wasAssociatedWith ?expert ;\n","            prov:generated ?mentalIllnessesSet .\n","    ?data a mls:Dataset ;\n","        rdfs:label ?dataSourceLabel .\n","    ?expert a prov:Person ;\n","        rdfs:label ?expertLabel .\n","    ?mentalIllnessesSet a miao:MentalIllnessesSet ;\n","        miao:hasMentalIllness ?mentalIllness .\n","    ex1:Depression rdfs:subClassOf miao:MentalIllness .\n","    ?depressionInstance a ex1:Depression ;\n","  }\n","\"\"\"\n",")\n","for result in q1:\n","    print(\"Expert {} use data source '{}' to detect depression\".format(result[0], result[1]))"],"metadata":{"id":"ExkmpERAeI0B","executionInfo":{"status":"ok","timestamp":1763904997700,"user_tz":-60,"elapsed":164,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"510215f8-f9fb-4c53-8b35-ef5cc93ec757"},"execution_count":3,"outputs":[{"output_type":"stream","name":"stdout","text":["Expert Dr. Laura García, PhD use data source 'Self-reported depression questionnaire responses' to detect depression\n","Expert Dr. Laura García, PhD use data source 'Therapist session notes' to detect depression\n"]}]},{"cell_type":"code","source":["## CQ ##\n","# Which mental illness schemas do experts reference during manual analysis?\n","\n","q2 = ex1_graph.query(\n","\"\"\"\n","  SELECT DISTINCT ?expertLabel ?schemaTitle\n","  WHERE {\n","    ?detection a miao:ManualMentalIllnessesDetection ;\n","              prov:wasAssociatedWith ?expert ;\n","              miao:usedMentalIllnessesSchema ?schema .\n","    ?expert a prov:Person ;\n","        rdfs:label ?expertLabel .\n","    ?schema dcterms:title ?schemaTitle .\n","  }\n","\"\"\"\n",")\n","\n","for result in q2:\n","    print(\"Expert {} used schema '{}'\".format(result[0], result[1]))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"jgnUyzPei_79","executionInfo":{"status":"ok","timestamp":1763905007697,"user_tz":-60,"elapsed":18,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"0739369d-c0f4-4530-d045-6fa0edb9afad"},"execution_count":4,"outputs":[{"output_type":"stream","name":"stdout","text":["Expert Dr. Laura García, PhD used schema 'DSM-5: Diagnostic and Statistical Manual, 5th Edition'\n"]}]},{"cell_type":"code","source":["## CQ ##\n","# What confidence scores do human experts assign to their manual diagnoses?\n","q3 = ex1_graph.query(\n","\"\"\"\n","  SELECT DISTINCT ?detectionLabel ?expertLabel  ?confidence\n","  WHERE {\n","    ?detection a miao:ManualMentalIllnessesDetection ;\n","              rdfs:label ?detectionLabel ;\n","              prov:wasAssociatedWith ?expert ;\n","              prov:generated ?mentalIllnessesSet .\n","    ?expert a prov:Person ;\n","        rdfs:label ?expertLabel .\n","    ?mentalIllnessesSet a miao:MentalIllnessesSet ;\n","        miao:hasMentalIllness ?mentalIllness .\n","    ?mentalIllness a ?mentalIllnessCategory ;\n","        miao:hasMentalIllnessDetectionConfidence ?confidence .\n","  }\n","\"\"\"\n",")\n","\n","for result in q3:\n","    print(\"Detection '{}' from expert '{}' has confidence {}\".format(result[0], result[1], result[2]))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ETd6nuo6jmwy","executionInfo":{"status":"ok","timestamp":1763905034409,"user_tz":-60,"elapsed":20,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"ee8ae915-f959-4b6b-f14c-8203ac106ce7"},"execution_count":5,"outputs":[{"output_type":"stream","name":"stdout","text":["Detection 'ManualDetectionGarciaP00010' from expert 'Dr. Laura García, PhD' has confidence 0.82\n"]}]},{"cell_type":"code","source":["## CQ ##\n","#  Which AI models can be used to detect depression?\n","q4 = ex2_graph.query(\n","\"\"\"\n","  PREFIX ex2: <https://w3id.org/miao/ex2#>\n","  SELECT DISTINCT ?modelLabel\n","  WHERE {\n","    ?detection a miao:AutomaticMentalIllnessesDetection ;\n","          mls:executes ?model ;\n","          prov:generated ?mentalIllnessesSet .\n","    ?model a mls:Implementation ;\n","        rdfs:label ?modelLabel .\n","     ?mentalIllnessesSet a miao:MentalIllnessesSet ;\n","        miao:hasMentalIllness ?mentalIllness .\n","    ?mentalIllness a ex2:Depression .\n","  }\n","\"\"\"\n",")\n","for result in q4:\n","    print(\"Model {} can be used to detect depression\".format(result[0]))"],"metadata":{"executionInfo":{"status":"ok","timestamp":1763905049285,"user_tz":-60,"elapsed":36,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"colab":{"base_uri":"https://localhost:8080/"},"id":"JW9Rwz3eAQVm","outputId":"7539b980-46d9-4bb6-9dba-ec9bbb5523b9"},"execution_count":6,"outputs":[{"output_type":"stream","name":"stdout","text":["Model PytorchBertModel can be used to detect depression\n","Model OpenRouterGPT4 can be used to detect depression\n","Model PytorchMultiModalTransformer can be used to detect depression\n"]}]},{"cell_type":"code","source":["## CQ ##\n","# Which AI models have been applied to detect anxiety from EEG signals?\n","q5 = ex2_graph.query(\n","\"\"\"\n","  PREFIX ex2: <https://w3id.org/miao/ex2#>\n","  SELECT DISTINCT ?modelLabel\n","  WHERE {\n","    ?detection a miao:AutomaticMentalIllnessesDetection ;\n","          mls:executes ?model;\n","          miao:hasInputData ex2:EEGSignals ;\n","          prov:generated ?mentalIllnessesSet .\n","    ?model a mls:Implementation ;\n","          rdfs:label ?modelLabel .\n","    ?mentalIllnessesSet a miao:MentalIllnessesSet ;\n","        miao:hasMentalIllness ?mentalIllness .\n","    ?mentalIllness a ex2:Anxiety .\n","  }\n","\"\"\"\n",")\n","for result in q5:\n","    print(\"Model '{}' has been used to detect anxiety from EEG signals\".format(result[0]))\n"],"metadata":{"id":"XkhRpO5pz_oi","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1763905065207,"user_tz":-60,"elapsed":20,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"77e804f5-d34b-4084-e2ab-6e65eb46a53d"},"execution_count":7,"outputs":[{"output_type":"stream","name":"stdout","text":["Model 'PytorchLSTMModel' has been used to detect anxiety from EEG signals\n"]}]},{"cell_type":"code","source":["## CQ ##\n","# Which AI models combine multiple data sources?\n","q6 = ex2_graph.query(\n","\"\"\"\n","  PREFIX ex2: <https://w3id.org/miao/ex2#>\n","  SELECT ?modelLabel (COUNT(?data) AS ?numDataSources)\n","  WHERE {\n","    ?detection a miao:AutomaticMentalIllnessesDetection ;\n","          mls:executes ?model;\n","          miao:hasInputData ?data .\n","    ?model a mls:Implementation ;\n","          rdfs:label ?modelLabel .\n","  }\n","  GROUP BY ?model ?modelLabel\n","  HAVING (COUNT(?data) > 1)\n","\"\"\"\n",")\n","for result in q6:\n","    print(\"Model '{}' combines multiple sources\".format(result[0]))\n","\n"],"metadata":{"id":"04OT0vl3fmTd","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1763905073475,"user_tz":-60,"elapsed":35,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"f2120e4e-bb65-4a1c-d2a5-b9c35f0ee033"},"execution_count":8,"outputs":[{"output_type":"stream","name":"stdout","text":["Model 'PytorchMultiModalTransformer' combines multiple sources\n"]}]},{"cell_type":"code","source":["## CQ ##\n","# Which AI models have been applied to detect multiple disorders simultaneously?\n","q7 = ex2_graph.query(\n","\"\"\"\n","  SELECT ?modelLabel (COUNT(DISTINCT ?illness) AS ?numDisorders)\n","  WHERE {\n","    ?detection a miao:AutomaticMentalIllnessesDetection ;\n","          mls:executes ?model;\n","          prov:generated ?mentalIllnessesSet .\n","\n","    ?mentalIllnessesSet miao:hasMentalIllness ?illness .\n","    ?model a mls:Implementation ;\n","          rdfs:label ?modelLabel .\n","  }\n","  GROUP BY ?model\n","  HAVING (COUNT(DISTINCT ?illness) > 1)\n","\"\"\"\n",")\n","for result in q7:\n","    print(\"Model '{}' have been applied to detect multiple disorder simultaneously\".format(result[0]))"],"metadata":{"id":"c_hZYnHg0HrZ","executionInfo":{"status":"ok","timestamp":1763905092058,"user_tz":-60,"elapsed":48,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"e49f99a5-45d3-4cc6-fe58-b771955016a1"},"execution_count":9,"outputs":[{"output_type":"stream","name":"stdout","text":["Model 'PytorchMultiModalTransformer' have been applied to detect multiple disorder simultaneously\n"]}]},{"cell_type":"code","source":["## CQ ##\n","# Are there AI models that can detect both depression and anxiety from the same data source?\n","q8 = ex2_graph.query(\n","\"\"\"\n","  SELECT DISTINCT ?modelLabel\n","  WHERE {\n","  ?detection a miao:AutomaticMentalIllnessesDetection ;\n","         mls:executes ?model;\n","         miao:hasInputData ?data ;\n","         prov:generated ?set .\n","  ?model a mls:Implementation ;\n","          rdfs:label ?modelLabel .\n","  ?set miao:hasMentalIllness ?ill1 ;\n","       miao:hasMentalIllness ?ill2 .\n","  ?ill1 a ex2:Depression .\n","  ?ill2 a ex2:Anxiety .\n","}\n","\"\"\"\n",")\n","for result in q8:\n","    print(\"Model '{}' can detect depression and anxiety from the same data source\".format(result[0]))"],"metadata":{"id":"YQ9_1m_g0Jbc","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1763905101351,"user_tz":-60,"elapsed":37,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"3a167643-59c2-4ae3-bf0b-4da1a5ac8451"},"execution_count":10,"outputs":[{"output_type":"stream","name":"stdout","text":["Model 'PytorchMultiModalTransformer' can detect depression and anxiety from the same data source\n"]}]},{"cell_type":"code","source":["## CQ ##\n","#  Which model achieved the highest accuracy in predicting depression?\n","q9 = ex2_graph.query(\n","\"\"\"\n","  PREFIX ex2: <https://w3id.org/miao/ex2#>\n","  SELECT ?modelLabel ?score\n","  WHERE {\n","    ?detection a miao:AutomaticMentalIllnessesDetection ;\n","          mls:executes ?model ;\n","          prov:generated ?mentalIllnessesSet ;\n","          mls:hasOutput ?evaluation .\n","\n","    ?model a mls:Implementation ;\n","          rdfs:label ?modelLabel .\n","\n","    ?evaluation a mls:ModelEvaluation ;\n","          mls:specifiedBy ex2:predictiveAccuracy ;\n","          mls:hasValue ?score .\n","\n","    ?mentalIllnessesSet miao:hasMentalIllness ?illness .\n","    ?illness a ex2:Depression .\n","  }\n","  ORDER BY DESC(?score)\n","  LIMIT 1\n","\"\"\"\n",")\n","for result in q9:\n","    print(\"Model '{}' detected Depression with accuracy of {} \".format(result[0], result[1]))\n"],"metadata":{"id":"dVsNfBdf0cYZ","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1763905111402,"user_tz":-60,"elapsed":40,"user":{"displayName":"Gianluca Apriceno","userId":"08608742979601712621"}},"outputId":"254d3448-2362-4cc7-c32f-09c60fd040ee"},"execution_count":11,"outputs":[{"output_type":"stream","name":"stdout","text":["Model 'OpenRouterGPT4' detected Depression with accuracy of 0.98 \n"]}]}]}